{
  "backend/main.mo": "Main Motoko actor for the TaskEarn platform implementing user registration, task management, task completion, contact submissions, and withdrawal requests with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms the old cafe-style actor state (menu items, contact info) into the new TaskEarn actor state (user profiles, tasks, completions, withdrawals) on canister upgrade.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (landing page, tasks page, authentication) to their associated source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the TaskEarn frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for the light and dark color themes used across the application.",
  "frontend/index.html": "Minimal HTML entry point titled 'Cafe Website' that mounts the React app at the root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Tasks, and Dashboard pages, wrapping them in a shared layout with Navigation, Footer, Toaster, and ProfileSetupModal.",
  "frontend/src/components/BalanceCard.tsx": "Card component that displays a user's current token balance with a loading skeleton state and a 'Earned from completed tasks' label.",
  "frontend/src/components/CompletedTasksList.tsx": "Displays a list of completed tasks with reward and date info, showing skeletons while loading and an empty state when no completions exist.",
  "frontend/src/components/ContactForm.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, platform info, and a copyright line with a Caffeine.ai attribution link.",
  "frontend/src/components/MenuItem.tsx": "Empty file with no content.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, desktop and mobile nav links, and auth controls (login/logout) using Internet Identity via the useAuth hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to choose a username and calls the registerUser mutation to create their profile.",
  "frontend/src/components/TaskCard.tsx": "Clickable card component that displays a task's category badge, token reward, title, and truncated description with a hover reveal for details.",
  "frontend/src/components/TaskDetailModal.tsx": "Dialog modal showing full task details and reward, allowing authenticated users to submit a completion or prompting unauthenticated users to log in.",
  "frontend/src/components/WithdrawalForm.tsx": "A form component that lets authenticated users request a token withdrawal, validating the amount against their current balance and showing success/error toasts via the useRequestWithdrawal mutation hook.",
  "frontend/src/hooks/useActor.ts": "A React Query-based hook that creates and caches an ICP backend actor, using the current Internet Identity and optionally initializing admin access control, then invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A hook that wraps Internet Identity login/logout logic, fetches the caller's user profile, and exposes auth state including whether a profile setup flow should be shown.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an InternetIdentityProvider and useInternetIdentity hook using @dfinity/auth-client to manage login, logout, and identity persistence with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for the app's backend interactions, including fetching tasks, completions, balance, user profile, and mutations for submitting completions, withdrawals, registration, and contact forms.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Space Grotesk fonts, configures Tailwind CSS, and defines a deep indigo/vibrant green design token palette for both light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ContactPage.tsx": "An empty file with no content, likely a placeholder for a future contact page component.",
  "frontend/src/pages/DashboardPage.tsx": "The authenticated dashboard page that displays the user's token balance, task completion summary, completed tasks list, and withdrawal form, redirecting unauthenticated users to the home page.",
  "frontend/src/pages/HomePage.tsx": "Landing page for the TaskEarn platform featuring a hero section with CTA buttons, a 'How It Works' three-step section, and authentication-aware sign-in prompt.",
  "frontend/src/pages/MenuPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/TasksPage.tsx": "Tasks browsing page that fetches available tasks, supports category filtering, displays tasks in a grid with skeleton loading states, and opens a detail modal on selection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Space Grotesk, Inter), OKLCH-based color tokens, border radii, box shadows, and animation keyframes for the TaskEarn UI.",
  "project_state.json": "Project state metadata tracking the current version, feature list, architectural notes, and image requirements for the TaskEarn platform build."
}